<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"63936f33702046a1b27272951210c36af140633f41edadbbfe697362bf68cf11","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1407 at https://github.com/cal-itp/data-infra/actions/runs/21611332613","plan_out_hash":"4db5ee7409970e8ed46c81cf149e3b3f9d836a0374f8af0a3eb475e4302910d1","plan_hash":"853d597a4b773770a26015a9bc2b07b6373a5f22405e9836b58240462705a50f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 15 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "57EeAg==" -> (known after apply)
!~      detect_md5hash      = "kwmnFy/FxUr7dnmDCPosRA==" -> "different hash"
!~      generation          = 1770075444594332 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "kwmnFy/FxUr7dnmDCPosRA==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_unzip_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "VGfPhg==" -> (known after apply)
!~      detect_md5hash      = "2ZK79GTQ8yecavoJT5etRA==" -> "different hash"
!~      generation          = 1770075444703315 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_unzip_hook.py"
!~      md5hash             = "2ZK79GTQ8yecavoJT5etRA==" -> (known after apply)
        name                = "plugins/hooks/gtfs_unzip_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FX2mrw==" -> (known after apply)
!~      detect_md5hash      = "W9kUYai6r7vIvglNB7RbRQ==" -> "different hash"
!~      generation          = 1770075444691598 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "W9kUYai6r7vIvglNB7RbRQ==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "MBwK0w==" -> (known after apply)
!~      detect_md5hash      = "B0tjZ6Mk+FcRPHbxEm9Ryw==" -> "different hash"
!~      generation          = 1770075444597508 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "B0tjZ6Mk+FcRPHbxEm9Ryw==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "9fno4A==" -> (known after apply)
!~      detect_md5hash      = "N4XY9eVgVQzOJVHhLIMmVg==" -> "different hash"
!~      generation          = 1770075444690072 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "N4XY9eVgVQzOJVHhLIMmVg==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "sEqSXQ==" -> (known after apply)
!~      detect_md5hash      = "qZgWW4nMPgL41gThninfnw==" -> "different hash"
!~      generation          = 1770075444694692 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "qZgWW4nMPgL41gThninfnw==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FDzk3g==" -> (known after apply)
!~      detect_md5hash      = "cJftSH+yHJ5jGmOH375thQ==" -> "different hash"
!~      generation          = 1770075444598576 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "cJftSH+yHJ5jGmOH375thQ==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "kX9glw==" -> (known after apply)
!~      detect_md5hash      = "TCQBdT8Ew3qt3H/fmJDIbw==" -> "different hash"
!~      generation          = 1770075444617026 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "TCQBdT8Ew3qt3H/fmJDIbw==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "k3LBtg==" -> (known after apply)
!~      detect_md5hash      = "1jAA2LgDJLEoyhyvQ6P/FQ==" -> "different hash"
!~      generation          = 1770075445821938 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "1jAA2LgDJLEoyhyvQ6P/FQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/docs/_docs_littlepay.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "x8b25A==" -> (known after apply)
!~      detect_md5hash      = "veBS1/Fbzfazo7kK6Doy6g==" -> "different hash"
!~      generation          = 1749663116384525 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/docs/_docs_littlepay.md"
!~      md5hash             = "veBS1/Fbzfazo7kK6Doy6g==" -> (known after apply)
        name                = "data/warehouse/models/docs/_docs_littlepay.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/payments/littlepay_feed_unions/_int_littlepay_unioned.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "hd0X8Q==" -> (known after apply)
!~      detect_md5hash      = "1ok1BljnTLcZ0yxi+5eUVQ==" -> "different hash"
!~      generation          = 1749663114797054 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/payments/littlepay_feed_unions/_int_littlepay_unioned.yml"
!~      md5hash             = "1ok1BljnTLcZ0yxi+5eUVQ==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/payments/littlepay_feed_unions/_int_littlepay_unioned.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/payments/littlepay_feed_unions/int_littlepay__unioned_settlements.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "nTj71Q==" -> (known after apply)
!~      detect_md5hash      = "hstQ1ZrQtGIxTBICNKlUcw==" -> "different hash"
!~      generation          = 1760473645064398 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/payments/littlepay_feed_unions/int_littlepay__unioned_settlements.sql"
!~      md5hash             = "hstQ1ZrQtGIxTBICNKlUcw==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/payments/littlepay_feed_unions/int_littlepay__unioned_settlements.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/payments/littlepay/_littlepay.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "z0l1MQ==" -> (known after apply)
!~      detect_md5hash      = "pQ3Or9N/wSYHXt235de9Zw==" -> "different hash"
!~      generation          = 1758129838549107 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/payments/littlepay/_littlepay.yml"
!~      md5hash             = "pQ3Or9N/wSYHXt235de9Zw==" -> (known after apply)
        name                = "data/warehouse/models/staging/payments/littlepay/_littlepay.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/payments/littlepay_v3/_littlepay_v3.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "OLGd3Q==" -> (known after apply)
!~      detect_md5hash      = "CT1Is41WF82GxtvZlgAPfw==" -> "different hash"
!~      generation          = 1758129838547810 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/payments/littlepay_v3/_littlepay_v3.yml"
!~      md5hash             = "CT1Is41WF82GxtvZlgAPfw==" -> (known after apply)
        name                = "data/warehouse/models/staging/payments/littlepay_v3/_littlepay_v3.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "zQ4FrQ==" -> (known after apply)
!~      detect_md5hash      = "jpiJOhzo/l1QXWfHqx0Pew==" -> "different hash"
!~      generation          = 1770075446954954 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "jpiJOhzo/l1QXWfHqx0Pew==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 15 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1407](https://github.com/cal-itp/data-infra/actions/runs/21611332613)